
## :x: Apply Failed

[CI link](https://github.com/soat-tech-challenge/terraform-aws-rds/actions/runs/6741959076)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/ddecd982-09a3-454c-a855-f2d0dc994d32/terraform-bin apply -input=false -auto-approve
data.aws_vpc.vpc: Reading...
data.aws_subnets.private_subnets: Reading...
data.aws_subnets.private_subnets: Read complete after 0s [id=us-east-2]
data.aws_vpc.vpc: Read complete after 1s [id=vpc-021977318f78d058f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_db_instance.soat_tc_rds_db will be created
  + resource "aws_db_instance" "soat_tc_rds_db" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = (known after apply)
      + db_subnet_group_name                  = "soat-tc-rds-subnet-group"
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "15.3"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "soat-tc-rds-db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + name                                  = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "soat-tc-rds-parameter-group"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 5432
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp2"
      + tags_all                              = {
          + "Project"    = "soat-tech-challenge"
          + "Repository" = "soat-tech-challenge/terraform-aws-rds"
        }
      + timezone                              = (known after apply)
      + username                              = "postgres"
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_db_parameter_group.soat_tc_rds_parameter_group will be created
  + resource "aws_db_parameter_group" "soat_tc_rds_parameter_group" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + family      = "postgres15"
      + id          = (known after apply)
      + name        = "soat-tc-rds-parameter-group"
      + name_prefix = (known after apply)
      + tags_all    = {
          + "Project"    = "soat-tech-challenge"
          + "Repository" = "soat-tech-challenge/terraform-aws-rds"
        }

      + parameter {
          + apply_method = "immediate"
          + name         = "log_connections"
          + value        = "1"
        }
    }

  # aws_db_subnet_group.soat_tc_rds_subnet_group will be created
  + resource "aws_db_subnet_group" "soat_tc_rds_subnet_group" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "soat-tc-rds-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-05b363559bcd99de3",
          + "subnet-0b0fa34fc5f29a727",
        ]
      + supported_network_types = (known after apply)
      + tags_all                = {
          + "Project"    = "soat-tech-challenge"
          + "Repository" = "soat-tech-challenge/terraform-aws-rds"
        }
      + vpc_id                  = (known after apply)
    }

  # aws_security_group.soat_tc_rds_sg will be created
  + resource "aws_security_group" "soat_tc_rds_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
        ]
      + name                   = "soat-tc-rds-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Project"    = "soat-tech-challenge"
          + "Repository" = "soat-tech-challenge/terraform-aws-rds"
        }
      + vpc_id                 = "vpc-021977318f78d058f"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + rds_instance_id = "soat-tc-rds-db"
aws_db_subnet_group.soat_tc_rds_subnet_group: Creating...
aws_db_parameter_group.soat_tc_rds_parameter_group: Creating...
aws_security_group.soat_tc_rds_sg: Creating...
aws_security_group.soat_tc_rds_sg: Creation complete after 1s [id=sg-07491ab9ba91992d4]
╷
│ Error: creating RDS DB Subnet Group (soat-tc-rds-subnet-group): AccessDenied: User: arn:aws:iam::381717072124:user/SOAT_TC_Terraform_User is not authorized to perform: rds:CreateDBSubnetGroup on resource: arn:aws:rds:us-east-2:381717072124:subgrp:soat-tc-rds-subnet-group because no identity-based policy allows the rds:CreateDBSubnetGroup action
│ 	status code: 403, request id: 7ab43c62-1c29-4693-9ffd-3ad4d0173b68
│ 
│   with aws_db_subnet_group.soat_tc_rds_subnet_group,
│   on main.tf line 13, in resource "aws_db_subnet_group" "soat_tc_rds_subnet_group":
│   13: resource "aws_db_subnet_group" "soat_tc_rds_subnet_group" {
│ 
╵
╷
│ Error: creatingDB Parameter Group (soat-tc-rds-parameter-group): AccessDenied: User: arn:aws:iam::381717072124:user/SOAT_TC_Terraform_User is not authorized to perform: rds:CreateDBParameterGroup on resource: arn:aws:rds:us-east-2:381717072124:pg:soat-tc-rds-parameter-group because no identity-based policy allows the rds:CreateDBParameterGroup action
│ 	status code: 403, request id: abedd31a-5fb2-4469-89e5-a0973f2f8719
│ 
│   with aws_db_parameter_group.soat_tc_rds_parameter_group,
│   on main.tf line 18, in resource "aws_db_parameter_group" "soat_tc_rds_parameter_group":
│   18: resource "aws_db_parameter_group" "soat_tc_rds_parameter_group" {
│ 
╵
::debug::Terraform exited with code 1.
::debug::stdout: data.aws_vpc.vpc: Reading...%0Adata.aws_subnets.private_subnets: Reading...%0Adata.aws_subnets.private_subnets: Read complete after 0s [id=us-east-2]%0Adata.aws_vpc.vpc: Read complete after 1s [id=vpc-021977318f78d058f]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_db_instance.soat_tc_rds_db will be created%0A  + resource "aws_db_instance" "soat_tc_rds_db" {%0A      + address                               = (known after apply)%0A      + allocated_storage                     = 20%0A      + apply_immediately                     = false%0A      + arn                                   = (known after apply)%0A      + auto_minor_version_upgrade            = true%0A      + availability_zone                     = (known after apply)%0A      + backup_retention_period               = (known after apply)%0A      + backup_window                         = (known after apply)%0A      + ca_cert_identifier                    = (known after apply)%0A      + character_set_name                    = (known after apply)%0A      + copy_tags_to_snapshot                 = false%0A      + db_name                               = (known after apply)%0A      + db_subnet_group_name                  = "soat-tc-rds-subnet-group"%0A      + delete_automated_backups              = true%0A      + deletion_protection                   = false%0A      + endpoint                              = (known after apply)%0A      + engine                                = "postgres"%0A      + engine_version                        = "15.3"%0A      + engine_version_actual                 = (known after apply)%0A      + hosted_zone_id                        = (known after apply)%0A      + id                                    = (known after apply)%0A      + identifier                            = "soat-tc-rds-db"%0A      + identifier_prefix                     = (known after apply)%0A      + instance_class                        = "db.t3.micro"%0A      + iops                                  = (known after apply)%0A      + kms_key_id                            = (known after apply)%0A      + latest_restorable_time                = (known after apply)%0A      + license_model                         = (known after apply)%0A      + listener_endpoint                     = (known after apply)%0A      + maintenance_window                    = (known after apply)%0A      + master_user_secret                    = (known after apply)%0A      + master_user_secret_kms_key_id         = (known after apply)%0A      + monitoring_interval                   = 0%0A      + monitoring_role_arn                   = (known after apply)%0A      + multi_az                              = (known after apply)%0A      + name                                  = (known after apply)%0A      + nchar_character_set_name              = (known after apply)%0A      + network_type                          = (known after apply)%0A      + option_group_name                     = (known after apply)%0A      + parameter_group_name                  = "soat-tc-rds-parameter-group"%0A      + password                              = (sensitive value)%0A      + performance_insights_enabled          = false%0A      + performance_insights_kms_key_id       = (known after apply)%0A      + performance_insights_retention_period = (known after apply)%0A      + port                                  = 5432%0A      + publicly_accessible                   = false%0A      + replica_mode                          = (known after apply)%0A      + replicas                              = (known after apply)%0A      + resource_id                           = (known after apply)%0A      + skip_final_snapshot                   = true%0A      + snapshot_identifier                   = (known after apply)%0A      + status                                = (known after apply)%0A      + storage_throughput                    = (known after apply)%0A      + storage_type                          = "gp2"%0A      + tags_all                              = {%0A          + "Project"    = "soat-tech-challenge"%0A          + "Repository" = "soat-tech-challenge/terraform-aws-rds"%0A        }%0A      + timezone                              = (known after apply)%0A      + username                              = "postgres"%0A      + vpc_security_group_ids                = (known after apply)%0A    }%0A%0A  # aws_db_parameter_group.soat_tc_rds_parameter_group will be created%0A  + resource "aws_db_parameter_group" "soat_tc_rds_parameter_group" {%0A      + arn         = (known after apply)%0A      + description = "Managed by Terraform"%0A      + family      = "postgres15"%0A      + id          = (known after apply)%0A      + name        = "soat-tc-rds-parameter-group"%0A      + name_prefix = (known after apply)%0A      + tags_all    = {%0A          + "Project"    = "soat-tech-challenge"%0A          + "Repository" = "soat-tech-challenge/terraform-aws-rds"%0A        }%0A%0A      + parameter {%0A          + apply_method = "immediate"%0A          + name         = "log_connections"%0A          + value        = "1"%0A        }%0A    }%0A%0A  # aws_db_subnet_group.soat_tc_rds_subnet_group will be created%0A  + resource "aws_db_subnet_group" "soat_tc_rds_subnet_group" {%0A      + arn                     = (known after apply)%0A      + description             = "Managed by Terraform"%0A      + id                      = (known after apply)%0A      + name                    = "soat-tc-rds-subnet-group"%0A      + name_prefix             = (known after apply)%0A      + subnet_ids              = [%0A          + "subnet-05b363559bcd99de3",%0A          + "subnet-0b0fa34fc5f29a727",%0A        ]%0A      + supported_network_types = (known after apply)%0A      + tags_all                = {%0A          + "Project"    = "soat-tech-challenge"%0A          + "Repository" = "soat-tech-challenge/terraform-aws-rds"%0A        }%0A      + vpc_id                  = (known after apply)%0A    }%0A%0A  # aws_security_group.soat_tc_rds_sg will be created%0A  + resource "aws_security_group" "soat_tc_rds_sg" {%0A      + arn                    = (known after apply)%0A      + description            = "Managed by Terraform"%0A      + egress                 = (known after apply)%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 5432%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 5432%0A            },%0A        ]%0A      + name                   = "soat-tc-rds-sg"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags_all               = {%0A          + "Project"    = "soat-tech-challenge"%0A          + "Repository" = "soat-tech-challenge/terraform-aws-rds"%0A        }%0A      + vpc_id                 = "vpc-021977318f78d058f"%0A    }%0A%0APlan: 4 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + rds_instance_id = "soat-tc-rds-db"%0Aaws_db_subnet_group.soat_tc_rds_subnet_group: Creating...%0Aaws_db_parameter_group.soat_tc_rds_parameter_group: Creating...%0Aaws_security_group.soat_tc_rds_sg: Creating...%0Aaws_security_group.soat_tc_rds_sg: Creation complete after 1s [id=sg-07491ab9ba91992d4]%0A
::debug::stderr: ╷%0A│ Error: creating RDS DB Subnet Group (soat-tc-rds-subnet-group): AccessDenied: User: arn:aws:iam::381717072124:user/SOAT_TC_Terraform_User is not authorized to perform: rds:CreateDBSubnetGroup on resource: arn:aws:rds:us-east-2:381717072124:subgrp:soat-tc-rds-subnet-group because no identity-based policy allows the rds:CreateDBSubnetGroup action%0A│ 	status code: 403, request id: 7ab43c62-1c29-4693-9ffd-3ad4d0173b68%0A│ %0A│   with aws_db_subnet_group.soat_tc_rds_subnet_group,%0A│   on main.tf line 13, in resource "aws_db_subnet_group" "soat_tc_rds_subnet_group":%0A│   13: resource "aws_db_subnet_group" "soat_tc_rds_subnet_group" {%0A│ %0A╵%0A╷%0A│ Error: creatingDB Parameter Group (soat-tc-rds-parameter-group): AccessDenied: User: arn:aws:iam::381717072124:user/SOAT_TC_Terraform_User is not authorized to perform: rds:CreateDBParameterGroup on resource: arn:aws:rds:us-east-2:381717072124:pg:soat-tc-rds-parameter-group because no identity-based policy allows the rds:CreateDBParameterGroup action%0A│ 	status code: 403, request id: abedd31a-5fb2-4469-89e5-a0973f2f8719%0A│ %0A│   with aws_db_parameter_group.soat_tc_rds_parameter_group,%0A│   on main.tf line 18, in resource "aws_db_parameter_group" "soat_tc_rds_parameter_group":%0A│   18: resource "aws_db_parameter_group" "soat_tc_rds_parameter_group" {%0A│ %0A╵%0A
::debug::exitcode: 1
::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"apply","PRNumber":2,"Program":"tfcmt","SHA1":"b01ce0cb6fac81033e6fadbbacdacb6bcb729850","Vars":{},"WorkflowName":"Terraform Apply"} -->